class Message
  def self.advise(name)
    [
      { name: "仕事", value: "やり続けることしかないということだけですよ。自分の仕事にオレ才能あるんだと..." },
      { name: "お金", value: "#{name}の一生かかって稼ぐ金、YAZAWAの2秒。そこんとこ、ヨロシク！" },
      { name: "恋愛", value: "アイ・ラブ・ユー オーケー？ 言っちゃえよ#{name}！" },
      { name: "人生", value: "#{name}の人生なんだから... てめぇで走れ！" },
      { name: "夢", value: "ドアの向こうに夢があるなら、ドアが開くまで叩き続けるんだ！" },
      { name: "挑戦", value: "最近勝ち組とか負け組みとか流行っているけど、スタート切っているかどうかがボクは大事だと思うけどね" },
      { name: "挫折", value: "最初、サンザンな目にあう。二度目、オトシマエをつける。三度目、余裕！" },
      { name: "幸せ", value: "アー・ユー・ハッピー？ #{name}はすでにハッピーなはずだぜ！" },
      { name: "老い", value: "年をとるってのは細胞が老けることであって、魂が老けることじゃない" },
      { name: "とくになし", value: "ボクは別にいいんだけど...  YAZAWAがなんて言うかな？" },
      { name: "明日のアドカレは？", value: "Part1はSayaさん、Part2はtomonariさんの登場だ！ヨロシク！！"}
    ]
  end
end